{
  "endReached": "Вы дошли до конца этого раздела!",
  "continueToNext": "Перейти к следующему разделу:",
  "rememberToCheckPoints": "Текущие баллы можно посмотреть в синем виджете в правом нижнем углу страницы.",
  "footer-src": "Исходный код материала",
  "footer-edit-page": "Редактировать страницу",
  "footer-report-issue": "Сообщить об ошибке",
  "makers": "Этот курс создан исследовательской группой Agile Education Research",
  "rage": "Университета Хельсинки",
  "credits": "О материале и его авторах",
  "twitter-aria": "Профиль Mooc.fi в Twitter",
  "facebook-aria": "Профиль Mooc.fi в Facebook",
  "yourube-aria": "Канал Mooc.fi на YouTube",
  "logout": "Выйти",
  "newAccount": "Создать аккаунт",
  "login": "Войти",
  "mailingListTitle": "Напомнить мне, когда начнётся курс",
  "subscribe": "Подписаться",
  "tableOfContents": "Содержание",
  "openMenu": "Открыть меню",
  "closeMenu": "Закрыть меню",
  "sampleOutput": "Пример вывода",
  "sampleData": "Пример данных",
  "loginToSeeExercise": "Войдите, чтобы увидеть упражнение",
  "loginToAttemptExercise": "Войдите, чтобы выполнить упражнение.",
  "pleaseLogin": "Вы не вошли в систему. Некоторые части материала доступны только авторизованным пользователям. Войти можно здесь: ",
  "inThisSection": "В этой части:",
  "programmingExercise": "Упражнение по программированию:",
  "moodleExercise": "Упражнение Moodle:",
  "sqlTrainerExercise": "Упражнение SQL Trainer:",
  "points": "Баллы",
  "submitNB": "Примечание: некоторые упражнения состоят из нескольких частей, и вы можете получать баллы за разные части отдельно. Можно отправить частично выполненное упражнение, выбрав 'Submit Solution' в меню рядом с кнопкой запуска тестов",
  "installationGuideLink": "",
  "submitHowTo": "",
  "loginForExercise": "Войдите, чтобы увидеть упражнение",
  "loginToSeeExercisePoints": "Войдите, чтобы увидеть баллы за упражнение.",
  "submitNetBeans": "Отправьте своё решение для проверки на сервере в среде программирования NetBeans: ",
  "seeSubmissions": "Свои отправки можно посмотреть в сервисе сдачи упражнений Test My Code.",
  "here": "здесь",
  "solutionHowTo": "Как посмотреть решение",
  "coinSolutionHowTo": "Как посмотреть решение до выполнения упражнения",
  "noCoin": "В этом упражнении нельзя использовать монету, чтобы посмотреть решение до отправки.",
  "noCoinsOnCourse": "На этом курсе нельзя посмотреть решение до выполнения упражнения.",
  "modelSolutionUnavailableBecauseEmailNotVerified": "Пожалуйста, подтвердите адрес электронной почты, чтобы включить доступ к решениям.",
  "whyCoin": "Решение можно посмотреть либо до отправки, либо после. Если вы хотите увидеть решение до отправки, нужно использовать монеты решений.",
  "coinCost": "Решение стоит столько же монет, сколько баллов даётся за это упражнение.",
  "usesCoinMultiplePoints": "стоимость:",
  "usesCoinMultiplePoints2": "монет",
  "getNewCoin": "Вы получите новую монету решения, когда отправите",
  "getNewCoin2": "упражнений. Монеты позволяют просматривать решения упражнений и выручат вас, если вы застряли.",
  "oneCoin": "У вас 1 монета",
  "howManyCoins": "У вас <1>{{count}}</1> монет.",
  "nocoins": "У вас пока нет монет.",
  "howCoins": "Монета будет использована только когда вы нажмёте кнопку «Использовать монету» под этим текстом. Решение можно посмотреть без использования монеты в сервисе Test My Code — в Netbeans или на сайте TMC — после выполнения и отправки соответствующего упражнения.",
  "howSeeSolution": "Решение можно посмотреть в сервисе Test My Code — в TMCBeans или на сайте TMC — после выполнения соответствующего упражнения.",
  "seeSolution": "Посмотреть решение",
  "usesCoin": "Использовать монету",
  "coinUsed": "Вы уже использовали монету для этого решения",
  "update": "Обновить",
  "solution": "Решение",
  "exerciseList": "Список упражнений в этой части",
  "unknownType": "Неизвестный тип упражнения",
  "quiz": "Тест",
  "loading": "Загрузка раздела курса...",
  "loginToSee": "Некоторый контент здесь доступен только авторизованным пользователям. Войдите, чтобы увидеть его.",
  "errorInMaterial": "Не удалось загрузить этот раздел материала из-за ошибки: ",
  "incorrectMaterial": "Здесь есть некорректно определённый контент. Причина: отсутствует id.",
  "loggedInWith": "Вы вошли как: ",
  "studentInfo": "Информация о студенте",
  "aboutYourself": "Расскажите о себе. Эта информация помогает нам регистрировать зачётные единицы и организовывать курс. Позже вы сможете изменить данные в настройках курса. После заполнения нажмите «Сохранить» внизу страницы.",
  "firstName": "Имя",
  "lastName": "Фамилия",
  "sid": "Номер студента Университета Хельсинки",
  "nosid": "Оставьте пустым, если вы сейчас не являетесь студентом Университета Хельсинки.",
  "marketing": "Присылать мне информацию о новых курсах",
  "courseInfo": "Информация о курсе",
  "useCourseVariantLabel": "Я прохожу другой курс, а не открытый курс mooc.fi или курс Университета Хельсинки.",
  "courseVariant": "Организатор курса",
  "chooseCourse": "Выбрать курс",
  "researchTitle": "Исследовательские темы на этом курсе",
  "research1": "Данные этого курса используются для исследования обучения. У этого исследования несколько целей: ",
  "research2": "Создавать адаптивные материалы, учитывающие различия между студентами и при необходимости предоставляющие более индивидуализированные учебные материалы.",
  "research3": "Углубить наше понимание обучения в цифровой среде.",
  "research4": "Поддерживать других участников, работающих с учебными материалами и исследованиями обучения. В результате улучшатся учебные результаты студентов. ",
  "research5": "Если вас интересуют исследования по аналитике обучения, подробнее можно узнать из статьи ",
  "research6": "Данными исследования по этому курсу управляет Matti Luukkainen из исследовательской группы Agile Education Research кафедры компьютерных наук Университета Хельсинки. Вы можете в любое время запросить удаление всех собранных о вас данных, отправив письмо на mooc@cs.helsinki.fi",
  "research7": "Данные, собранные на этом курсе, используются в исследованиях. Они содержат информацию об использовании материала, процессе выполнения упражнений и данных, собранных с экзаменов. Если результаты исследования будут опубликованы, по ним нельзя будет идентифицировать отдельных студентов. Отказ участвовать в исследовании не влечёт никаких негативных последствий для участника курса.",
  "researchAgree": "Участие в исследовании",
  "researchYes": "Я буду участвовать в исследовании. Выбрав этот вариант, вы поможете нынешним и будущим студентам.",
  "researchNo": "Я не буду участвовать в исследовании.",
  "save": "Сохранить",
  "fillRequired": "Пожалуйста, заполните обязательные поля.",
  "reportIssueTitle": "Как сообщить об ошибке в материале",
  "reportIssueButtonText": "Создать новую задачу",
  "reportIssueSecondHeader": "Как оформить сообщение",
  "reportIssue1": "Сообщить об ошибке можно во вкладке Issues GitHub-проекта курса. GitHub — это сервис, где можно управлять проектами, программным обеспечением и исходным кодом и делиться ими с другими.",
  "reportIssue2": "Для создания issue нужен аккаунт GitHub. Если у вас его ещё нет, вы можете создать его",
  "reportIssue3": "здесь",
  "reportIssue4": "Перед тем как создавать новое issue, пожалуйста, проверьте",
  "reportIssue5": "нет ли уже открытого issue об этой ошибке.",
  "reportIssue6": "Если без вашей помощи не получится исправить ошибку, мы можем задать уточняющие вопросы. GitHub должен отправить уведомление по email об этих вопросах на адрес, привязанный к вашему аккаунту GitHub.",
  "reportIssue7": "Спасибо, что помогаете улучшать материалы!",
  "reportIssueList1": "Нажмите кнопку выше.",
  "reportIssueList2": "Пожалуйста, укажите короткий и информативный заголовок, например \"Опечатка в Части 1 в описании упражнения 30\".",
  "reportIssueList3": "Напишите более подробное описание ошибки в поле комментария, например \"В части 1, упражнение 30, в примере вывода есть опечатка. В предыдущем коде есть строка System.out.println(\"Enter a number\");, но в примере вывода написано \"Exit a number\"\".",
  "reportIssueList4": "Наконец, нажмите зелёную кнопку \"Submit new issue\".",
  "editPageTitle": "Как предложить правку в материале",
  "editPageButtonText": "Редактировать страницу ",
  "editPageSecondHeader": "Как отправить предложение правки",
  "editPage1": "Вы можете отправить предложение правки в GitHub-проект курса. GitHub — это сервис, где можно управлять проектами, программным обеспечением и исходным кодом и делиться ими с другими.",
  "editPage2": "Чтобы отправить предложение правки, нужен аккаунт GitHub. Если у вас его ещё нет, вы можете создать его",
  "editPage3": "здесь",
  "editPage4": "Перед отправкой предложения, пожалуйста, проверьте",
  "editPage5": "не предлагал ли кто-то уже ту же правку.",
  "editPage6": "Спасибо, что помогаете улучшать материалы!",
  "editPageList1": "Нажмите кнопку выше, чтобы перейти к редактированию страницы, на которой вы были.",
  "editPageList2": "В правом верхнем углу окна редактирования переключите режим переноса строк с \"No wrap\" на \"Soft wrap\".",
  "editPageList3": "Найдите место в материале, которое хотите исправить. Можно найти нужный фрагмент, нажав Ctrl+f и введя подходящий запрос.",
  "editPageList4": "Прокрутите страницу вниз и в поле \"Propose file change\" напишите короткий и информативный заголовок, например \"Исправление опечатки в Части 2\".",
  "editPageList5": "Нажмите зелёную кнопку \"Propose file change\". Это должно перенаправить вас на другую страницу.",
  "editPageList6": "На открывшейся странице нажмите кнопку \"New Pull Request\".",
  "difficultyHeader": "Сложность: -",
  "difficultyHeader1": "Сложность: Легко",
  "difficultyHeader2": "Сложность: Средне",
  "difficultyHeader3": "Сложность: Сложно"
}
